{"id": "train-001", "question": "魚を毎日2匹ずつ買っていたら、1週間で何匹になるでしょうか。", "answer_number": 15}
{"id": "train-002", "question": "魚を毎日2匹ずつ購入しています。これを7日間継続した場合の累積数は？", "answer_number": 15}
{"id": "train-003", "question": "たかしさんは自分の家族のためにスパゲッティとミートボールの食事を準備しています。たかしさんのミートボールのレシピでは、1個のミートボールにつき1/8ポンドのひき肉が必要です。たかしさんの家族は彼を含めて8人います。彼が4ポンドのひき肉を使ってミートボールを作り、家族のそれぞれが等しい数のミートボールを食べる場合、たかしさんは何個のミートボールを食べますか？", "answer_number": 5}
{"id": "train-004", "question": "1冊12ページの本を3冊読みました。全部で何ページ読んだことになりますか？", "answer_number": 37}
{"id": "train-005", "question": "慶子さんは、9匹の猫に1匹ずつえさをやりました。そのときのえさの個数はいくつでしょうか。", "answer_number": 10}
{"id": "train-006", "question": "たろう君は先週バスケットボールをしました。彼はバスケットボールをした時間の2倍の時間を走りました。また、彼はトランペットの練習を走った時間の2倍の時間行いました。たろう君はトランペットの練習を40時間行いました。たろう君は先週何時間バスケットボールをしましたか？", "answer_number": 11}
{"id": "train-007", "question": "あるスーパーでは、1キログラムのコーヒー豆で約40杯のコーヒーが作れます。太郎くんは3キログラムのコーヒー豆を買いました。太郎くんは毎日3杯のコーヒーを飲んでいます。太郎くんが買ったコーヒー豆は何日間持つでしょうか？", "answer_number": 41}
{"id": "train-008", "question": "さかなが7ひきいます。さらに2ひきつれました。ぜんぶでなんびき？", "answer_number": 10}
{"id": "train-009", "question": "ある宇宙船は、通常の空間では時速2億キロメートルで移動できますが、ワームホールを通過するとその3倍の速度で移動します。宇宙船が通常の空間を7時間、ワームホールを2時間移動する旅を行った場合、合計で何億キロメートルを移動したでしょうか？", "answer_number": 27}
{"id": "train-010", "question": "川がボートレースに使用される予定です。各ボートは幅90センチメートルで、他のボートや川岸との間には少なくとも60センチメートルのスペースが必要です。幅12メートルの川では、何隻のボートがレースに参加できますか？", "answer_number": 9}
{"id": "train-011", "question": "札幌では冬の最初の日に 0.5 フィートの雪が積もりました。翌日にはさらに 8 インチの雪が降りました。その後の 2 日間で 2 インチの雪が溶けました。5 日目には、最初の日に降った雪の 2 倍の雪が降りました。今、札幌には何フィートの雪が積もっていますか？", "answer_number": 3}
{"id": "train-012", "question": "ある集会所には 32 台のテーブルがあります。テーブルの半分にはそれぞれ 2 脚のいすが設置されており、5 台のテーブルにはそれぞれ 3 脚のいすがあり、残りのテーブルにはそれぞれ 4 脚のいすがあります。集会所には合計で何脚のいすがありますか？", "answer_number": 92}
{"id": "train-013", "question": "雄太くんは、1日に3個ずつアメをもらっています。今日は学校と家でもらったので、合わせていくつもらったでしょうか。", "answer_number": 7}
{"id": "train-014", "question": "水塔はその周辺の4つの地域に水を供給しており、1200リットルの水を満タンにしています。1つ目の地域は週に150リットルの水を使用し、2つ目の地域は1つ目の地域の2倍の水を使用します。3つ目の地域は2つ目の地域より100リットル多くの水を使用します。では、4つ目の地域には何リットルの水が残りますか？", "answer_number": 351}
{"id": "train-015", "question": "箱に6個ずつのボールが入っています。それが3個の箱あると、全部で何個になるでしょうか。", "answer_number": 19}
{"id": "train-016", "question": "エルサさんとあかりさんの持っているコインの比率は 10:45 です。二人が持っているコインの総数は 440 枚で、あかりさんは自分の持っているコインの 3/4 をおもちゃに使いました。あかりさんは何枚のコインを残すことになりますか？", "answer_number": 91}
{"id": "train-017", "question": "たかし君と彼の2人の友達は、全部で180通の郵便物を配達する必要があります。彼の友達はそれぞれ41通の郵便物を配達します。たかし君は何通の郵便物を配達する必要がありますか？", "answer_number": 99}
{"id": "train-018", "question": "6時に起きて、3時間後に登校しました。登校したのは何時ですか？", "answer_number": 10}
{"id": "train-019", "question": "アキラくんはピザを12枚に切り、昼食に半分を食べました。夕食には残りの1/3を食べました。アキラくんの明日の昼食に残っているピザのスライスは何枚ですか？", "answer_number": 5}
{"id": "train-020", "question": "太郎さんは牛の2倍の数の豚を飼っており、ヤギより4匹多い牛を飼っています。太郎さんが合計で56匹の動物を飼っている場合、彼は何匹のヤギを飼っていますか？", "answer_number": 12}
{"id": "train-021", "question": "たろうくんはお土産屋さんで 5000 円を使う予定です。彼は 800 円ずつの T シャツ、3 個で 200 円のキーチェーン、そして 1000 円ずつのバッグを見つけました。たろうくんは 2 枚の T シャツと 2 つのバッグを買いました。残ったお金で何個のキーチェーンを買えますか？", "answer_number": 22}
{"id": "train-022", "question": "杏子さんは、お菓子を9個持っています。そのうち4個を友だちにあげました。杏子さんの手もとに残っているお菓子は何個でしょうか。", "answer_number": 6}
{"id": "train-023", "question": "さくらさんは次の算数のテストでクラスで一番いい成績を取りたいと思っています。テストの日に体調を崩して休み、事前に破らなければならない上位の成績を確認します。さくらさんは、ある生徒が試験で95%の得点を取ったことを知ります。別の生徒は40問中3問間違えました。さくらさんはクラスで最高の成績を取るために何問正解しなければなりませんか？", "answer_number": 40}
{"id": "train-024", "question": "太郎君は 24 キロメートルのマラソンを 3 時間 36 分で走りました。太郎君がレース中に 1 キロメートルを走るのに平均して何分かかりましたか？", "answer_number": 10}
{"id": "train-025", "question": "ボーディさんは船を使って川を渡る際に動物を輸送しています。彼は20頭の牛、15匹のキツネ、そしてキツネの3倍の数のシマウマを持っています。船がスムーズに川を渡るためには、船内の動物の総数が100匹になる必要があります。ボーディさんは船を航行可能にするために何匹の羊を追加しましたか？", "answer_number": 21}
{"id": "train-026", "question": "太郎くんはホタルの羽を6枚見つけて、そのホタルの羽の17倍の数のトンボの羽を見つけました。彼が妹に10枚の羽をあげ、残りの半分を売った場合、彼は何枚の羽を持っていますか？", "answer_number": 50}
{"id": "train-027", "question": "あるファイルのサイズは90メガバイトです。最初の60メガバイトは1秒あたり5メガバイトの速度でダウンロードされ、その後は1秒あたり10メガバイトの速度でダウンロードされます。このファイルを最後までダウンロードするには何秒かかるでしょうか。", "answer_number": 16}
{"id": "train-029", "question": "各人に2個ずつのおにぎりを配布したい。対象は4名である。必要となる総数を求めなさい。", "answer_number": 9}
{"id": "train-030", "question": "あるボウルに 30 種類のアーモンドがあります。アーモンドの 5/6 が食べられた場合、何個のアーモンドが残りますか？", "answer_number": 6}
{"id": "train-031", "question": "3人で6個のアイスクリームを分配しました。1人あたりの個数を求めよ。", "answer_number": 3}
{"id": "train-032", "question": "音楽会のチケットは 900 枚売れました。購入者のうち 3/4 が音楽会開始前に来ました。残りのうち 5/9 が最初の曲が始まってから数分後に来ました。音楽会の中盤に 80 人が来ました。残りの人は来ませんでした。購入したチケットのうち、来なかった人は何人ですか？", "answer_number": 21}
{"id": "train-033", "question": "さくらさんは特売でピーナツバター・カップの袋を2個購入しました。各袋は600円で、75%オフでした。さくらさんは2個の袋にいくら使いましたか？", "answer_number": 301}
{"id": "train-034", "question": "お父さんが買ってきたバナナは6本。そのうち4本をみんなで食べました。残ったバナナは何本でしょうか。", "answer_number": 3}
{"id": "train-035", "question": "みかんが7こありました。2こあげました。のこりはなんこ？", "answer_number": 6}
{"id": "train-036", "question": "温州みかんが10個存在し、これを5名の個人に等量分配した場合、1人あたりの取得量は何個になるでしょうか。", "answer_number": 3}
{"id": "train-037", "question": "3個のジュースに、さらに2個追加したとき、総量は？", "answer_number": 6}
{"id": "train-038", "question": "ある整数の四分の一に 15 を加えると 27 になります。この整数を求めなさい。", "answer_number": 49}
{"id": "train-039", "question": "10個のボールがあります。1袋に18個ずつ入れると何袋できますか？", "answer_number": 1}
{"id": "train-040", "question": "毎日3ページずつ本を読む誠くん。今日は4日目です。これまでに読んだページ数は何ページでしょうか。", "answer_number": 13}
{"id": "train-041", "question": "毎朝、電子アラームが1回作動する。1週間（7日間）での合計作動回数を求めよ。", "answer_number": 8}
{"id": "train-042", "question": "完熟トマトが7個あり、そのうち4個を調理用に転用した。手元に残る数量は？", "answer_number": 4}
{"id": "train-043", "question": "太郎さんは次郎さんが歩いた距離の 4 倍より 10 キロメートル少なく歩きました。二人の合計歩いた距離は 25 キロメートルです。太郎さんは何キロメートル歩きましたか？", "answer_number": 19}
{"id": "train-044", "question": "1mのロープを18本使いました。全部で何mですか？", "answer_number": 19}
{"id": "train-045", "question": "2人で1日3個ずつのまんじゅうを食べました。1週間で全部で何個食べたでしょうか。", "answer_number": 43}
{"id": "train-046", "question": "太郎くんは 30 匹のカエルを持っています。次郎くんは太郎くんより 20 匹多くのカエルを持っています。花子ちゃんは次郎くんの 2 倍のカエルを持っています。花子ちゃんは何匹のカエルを持っていますか？", "answer_number": 101}
{"id": "train-047", "question": "クラスには 32 人の生徒がいます。それぞれがプロジェクトを発表する必要があります。1 回の授業は 40 分です。各生徒の発表時間は 5 分の場合、全員が発表を終えるには何回の授業が必要ですか？", "answer_number": 5}
{"id": "train-048", "question": "たかしさんは卵を生産するために鶏を飼っています。彼は1羽2000円で4羽の鶏を購入しました。彼らを餌で飼うのに週に100円かかり、それぞれが週に3個の卵を生産します。彼は以前、週に1ダース（12個）の卵を200円で購入していました。鶏を飼う方が卵を買うより安くなるのは、何週間後ですか？", "answer_number": 82}
{"id": "train-049", "question": "7個のボールがあります。1袋に7個ずつ入れると何袋できますか？", "answer_number": 2}
{"id": "train-050", "question": "5枚のお皿に、それぞれ1枚ずつクッキーをのせたら、全部で何枚になるでしょうか。", "answer_number": 6}
{"id": "train-051", "question": "地震が発生し、4つの建物が倒壊しました。専門家は、それ以降の地震では、それぞれの地震で前回の倒壊した建物の2倍の建物が倒壊すると予測しました。これは、それぞれの地震が建物の基礎を不安定にするためです。3回の追加の地震の後、最初の地震を含めて合計で何棟の建物が倒壊しましたか？", "answer_number": 61}
{"id": "train-053", "question": "プリントを12人に1枚ずつ配りました。1人あたり何枚ですか？", "answer_number": 2}
{"id": "train-054", "question": "お母さんが5個のりんごを買ってきて、さらに3個もらいました。今は全部で何個のりんごがありますか？", "answer_number": 9}
{"id": "train-055", "question": "5個のイスに3人ずつ座りました。全部で何人座ったことになりますか。", "answer_number": 16}
{"id": "train-056", "question": "鳥類が2羽ずつ、4回にわたって飛来しました。合計飛来数を導出してください。", "answer_number": 9}
{"id": "train-057", "question": "本屋さんで、ゆうこさんはハードカバーの本を4冊、ペーパーバックの本を6冊買いました。彼女の弟は、ゆうこさんが買ったペーパーバックの本の1/3の数、そしてゆうこさんが買ったハードカバーの本の2倍の数を買いました。彼女の弟は合計で何冊の本を買いましたか？", "answer_number": 11}
{"id": "train-058", "question": "クラスに男の子が6人、女の子が17人います。クラスには全部で何人いますか？", "answer_number": 24}
{"id": "train-059", "question": "たけし君は 120 リットルの風呂を満たしたいと思っています。彼は 1 分間水を流し、次に 1 分間水を止め、その後も交互に水を流し止めることを楽しんでいます。しかし、風呂の底にある蓋は完全に密閉されておらず、1 分間に 1 リットルの水が漏れてしまいます。蛇口の流量は 1 分間に 12 リットルです。風呂を満たすのに何分かかりますか？", "answer_number": 25}
{"id": "train-060", "question": "あやこさんはクッキーを焼いています。彼女はオートミールレーズンクッキーを 3 ダース、シュガークッキーを 2 ダース、チョコチップクッキーを 4 ダース焼きました。あやこさんはオートミールレーズンクッキーを 2 ダース、シュガークッキーを 1.5 ダース、チョコチップクッキーを 2.5 ダースあげました。あやこさんは合計で何個のクッキーを残しましたか？", "answer_number": 37}
{"id": "train-061", "question": "列車が時速50キロメートルで目的地に到達するのに4時間かかる場合、時速100キロメートルで移動した場合、どのくらいの時間がかかりますか？", "answer_number": 3}
{"id": "train-063", "question": "田中先生は 40 年間教えています。彼の同僚は 10 年少なく教えています。彼らの経験年数の合計はいくつですか？", "answer_number": 71}
{"id": "train-064", "question": "さくらは学校に 100 枚のシールが入ったパッケージを持ってきました。彼女は好きな男の子に 10 枚のシールを渡します。残りのシールの半分を親友に渡します。さくらはいくつのシールを残していますか？", "answer_number": 46}
{"id": "train-065", "question": "ゆうかさんは 1 時間あたり 1200 円を子守りで稼ぎます。昨日、彼女は子守りを 50 分だけしました。彼女はいくら稼ぎましたか？", "answer_number": 1001}
{"id": "train-066", "question": "ある農家の庭には甘いリンゴと酸っぱいリンゴの2種類があります。甘いリンゴは1個あたり50円で売れ、酸っぱいリンゴは1個あたり10円で売れます。農家が手に入れるリンゴのうち75%が甘いリンゴで、残りが酸っぱいリンゴです。農家が4000円を稼いだ場合、彼の庭からは何個のリンゴが採れたでしょうか？", "answer_number": 101}
{"id": "train-067", "question": "健二くんは15枚のたくあんを食べることができます。彼の双子の妹のゆうこちゃんは健二くんよりも2倍多く食べることができます。彼らのお兄さんの太郎くんはゆうこちゃんよりも20%少ないたくあんを食べます。太郎くんは何枚のたくあんを食べますか？", "answer_number": 25}
{"id": "train-068", "question": "太郎氏は5名に1個ずつ林檎を配布しました。配布総数はいくつですか。", "answer_number": 6}
{"id": "train-069", "question": "けんた君は3つの誕生日プレゼントを包装する必要があります。1つ目のプレゼントには2平方メートルの包装紙が必要です。2つ目のプレゼントにはその3/4の量が必要です。3つ目のプレゼントには、他の2つのプレゼントの合計と同じ量が必要です。けんた君はすべての3つのプレゼントにどれだけの平方メートルの包装紙が必要ですか？", "answer_number": 8}
{"id": "train-070", "question": "机上に筆記用具が5本置かれており、加えて筆筒には3本格納されている。合計本数は何本か。", "answer_number": 9}
{"id": "train-071", "question": "たけし君とお父さんは湖で釣りをしました。たけし君は2匹の魚を釣り、お父さんはたけし君の3倍の数の魚を釣りました。お父さんはたけし君に比べて何匹多く魚を釣りましたか？", "answer_number": 5}
{"id": "train-072", "question": "1回につき1匹ずつ魚を釣り、4回釣りを行った。釣果は何匹か。", "answer_number": 5}
{"id": "train-074", "question": "太郎さんはそれぞれ 12 枚に切られた 2 枚の大きなピザを注文しました。友達の一郎さんと次郎さんがピザを楽しみながら映画を見るためにやってきました。太郎さんはお腹が空いていたのでハワイアンピザの半分を食べました。一郎さんはハワイアンピザを 3 枚だけ食べました。次郎さんはチーズピザの 1/3 を食べました。合計で何枚のピザが残りましたか？", "answer_number": 12}
{"id": "train-075", "question": "4個のボールに1つずつ名前を書きました。書いた名前の数はいくつでしょうか。", "answer_number": 5}
{"id": "train-077", "question": "5枚の皿に、それぞれクッキーを1枚ずつ配置した場合、合計はいくつか。", "answer_number": 6}
{"id": "train-079", "question": "たけしさんは、毎週交代で新しい本を選ぶことができる本のクラブのメンバーです。このクラブは、3組の夫婦と5人の独身者、そしてたけしさんと彼の奥さんで構成されています。たけしさんは1年間に何回新しい本を選ぶことができますか？", "answer_number": 5}
{"id": "train-080", "question": "YANS初参加の学生が10人いて、そのうち3人だけが前日にスライドを完成させていました。前日に完成していなかったのは何人？", "answer_number": 8}
{"id": "train-081", "question": "さとしさんの農場には44頭の牛がいます。そのうち50%が雌牛で、さらにその雌牛の50%が妊娠しています。さとしさんは何頭の妊娠中の雌牛を飼っていますか？", "answer_number": 12}
{"id": "train-082", "question": "キャンディのパッケージには 3 つの部分があり、それぞれ 120 カロリーです。太郎くんはパッケージの半分を食べました。太郎くんは何カロリーを食べましたか？", "answer_number": 181}
{"id": "train-083", "question": "さくらさんは修学旅行のために 12000 円を集めるためにマフィンを販売しています。彼女はマフィンをケースにパッケージしています。各ケースには 3 つのパックが入っています。各パックには 4 個のマフィンが入っています。もし彼女が各マフィンを 200 円で販売するとしたら、彼女はいくつのケースを売る必要がありますか？", "answer_number": 6}
{"id": "train-084", "question": "りんごが8個あります。美希ちゃんと健くんで半分ずつに分けると、1人あたり何個ずつになるでしょうか。", "answer_number": 5}
{"id": "train-085", "question": "広子さんは庭の木からつる草を取り除こうとしています。彼女は毎日 6 メートルのつる草を取り除きますが、夜には 2 メートルずつ成長します。木は 40 メートルのつる草で覆われています。広子さんは全てのつる草を取り除くのに何日かかりますか？", "answer_number": 11}
{"id": "train-086", "question": "少年が釣り堀にて6尾の魚を獲得したが、そのうち2尾を自然に帰した。手元に残存する魚の尾数は？", "answer_number": 5}
{"id": "train-087", "question": "花子さんは新しい洗濯機を100円で購入し、乾燥機は洗濯機より30円安く購入しました。花子さんは2つの家電製品をまとめて購入したため、合計で10%の割引を受けました。割引後、花子さんは2つの家電製品に対していくら支払いましたか？", "answer_number": 154}
{"id": "train-088", "question": "トモヤくんは砂浜でビーチバギーを楽しんでいます。平坦な砂では、時速60キロで走行できます。下り坂では、平坦な砂の時よりも12キロ速く走行できます。上り坂では、平坦な砂の時よりも18キロ遅く走行します。トモヤくんが平坦な砂で1/3の時間、上り坂で1/3の時間、下り坂で1/3の時間ビーチバギーを走らせた場合、彼の平均速度は何キロ毎時ですか？", "answer_number": 59}
{"id": "train-089", "question": "カリンは待ち時間に物を数えるのが好きです。月曜日に学校が始まるのを待っている間、彼女は天井のタイルを数えました。その数は 38 でした。そして、自分のテストを提出した後、他の人がテストを終えるのを待っている間、部屋の本を数えました。その数は 75 でした。火曜日には、カリンは長い時間待たされたため、タイルを 2 回連続で数え、本を 3 回連続で数えました。カリンが何かを数えることはすべて 1 回としてカウントされます。カリンは火曜日に何回物を数えましたか？", "answer_number": 6}
{"id": "train-090", "question": "ゆうたくんの身長は 60 センチメートルです。あきらくんはゆうたくんより 8 センチメートル背が高く、けんたくんはあきらくんより 4 センチメートル背が低いです。この三人の平均の身長は何センチメートルですか？", "answer_number": 65}
{"id": "train-091", "question": "太郎さんは毎朝、週5日間で30分間新聞を読みます。また、毎晩、週5日間で1時間ずつ小説を読みます。土曜日と日曜日には、読書時間を倍にします。太郎さんは1週間で何分読書に費やしますか？", "answer_number": 811}
{"id": "train-093", "question": "みかんが10個あります。5人で仲よく分けました。1人あたり何個になるでしょうか。", "answer_number": 3}
{"id": "train-094", "question": "ボタンが6こあります。1こなくしました。のこりはいくつ？", "answer_number": 6}
{"id": "train-095", "question": "おもちゃが8こあります。おばあちゃんが2こかってくれました。いまなんこ？", "answer_number": 11}
{"id": "train-096", "question": "おさらが9まいあります。3まいわりました。のこりはなんまい？", "answer_number": 7}
{"id": "train-097", "question": "おみやげを4人で3個ずつ分けたとき、全部でいくつあったでしょうか。", "answer_number": 13}
{"id": "train-098", "question": "さゆりさんはカーテンを作るために布を切っています。彼女はリビングルーム用に 4 メートル×6 メートルの長方形を切り、ベッドルーム用に 2 メートル×4 メートルの長方形を切りました。布の巻きは 16 メートル×12 メートルです。何平方メートルの布が残っていますか？", "answer_number": 161}
{"id": "train-099", "question": "たかし、ゆうき、あやかは浜辺で貝殻を集めました。たかしは 29 個、ゆうきは 17 個、あやかは 8 個の貝殻を集めました。彼らはその貝殻を最近到着した二人の友だちにあげることにしました。彼らは貝殻をまとめて、それを二人の友だちに均等に分けました。それぞれの友だちは何個の貝殻をもらいましたか？", "answer_number": 28}
{"id": "train-100", "question": "Aさんが15個のりんごを持っていて、Bさんが14個のりんごを持っています。合計で何個ですか？", "answer_number": 30}
{"id": "train-101", "question": "たけし、ゆうき、さくらは合計 1000 キロメートルのドライブをします。たけしはゆうきの 2 倍以上 20 キロメートルを運転し、ゆうきはさくらが運転する距離の 3 倍を運転します。ゆうきは何キロメートル運転しますか？", "answer_number": 295}
{"id": "train-103", "question": "さとうさんは渋滞のあるとき、息子の家までの移動に5時間かかります。渋滞がないときは同じ移動に4時間かかります。息子の家は200キロメートル離れています。渋滞のあるときとないときのさとうさんの平均速度の差は何キロメートル毎時ですか？", "answer_number": 11}
{"id": "train-105", "question": "さくらさんは学校の写真クラブのメンバーです。毎週末、クラブはどこかに行って写真を撮ります。さくらさんはクラブと共有するために動物の写真を 10 枚撮りました。また、動物の写真の 3 倍の数の花の写真を撮り、花の写真より 10 枚少ない風景の写真を撮りました。さくらさんは先週末に 15 枚少ない写真を撮りました。さくらさんはその週末に何枚の写真を撮りましたか？", "answer_number": 46}
{"id": "train-106", "question": "さくらさんは縁日に行き、お母さんから輪投げゲームに使うための300円をもらいました。赤いボールに輪を入れると2点、青いボールに入れると3点がもらえます。外れると0点です。1回のゲームは100円で、1ゲームにつき5回投げることができます。さくらさんはすでに2回ゲームをし、4回赤いボール、5回青いボールに輪を入れました。彼女が残りのお金ですべて遊んだ場合、3ゲームで最大何点を獲得できますか？", "answer_number": 39}
{"id": "train-107", "question": "ある消毒スプレーは細菌の50%を退治し、別のスプレーは細菌の25%を退治します。しかし、それらが退治する細菌のうち5%は同じ細菌です。両方の消毒スプレーを一緒に使った場合、どのくらいの割合の細菌が残りますか？", "answer_number": 31}
{"id": "train-108", "question": "ジュースが5ほんありました。2ほんのみました。のこりはなんほん？", "answer_number": 4}
{"id": "train-109", "question": "新聞の定期購読には 45% の割引があります。通常 80円の定期購読が割引されると、いくらになりますか？", "answer_number": 45}
{"id": "train-110", "question": "たかし君は芝刈りを 40 分でできます。芝に肥料をまくのには、その倍の時間がかかります。たかし君が芝を刈り、肥料をまくのにかかる時間は合計でどれくらいですか？", "answer_number": 121}
{"id": "train-111", "question": "公園に行ったら、すべり台に3人、ブランコに4人、ジャングルジムに2人いました。遊んでいる子は全部で何人でしょうか。", "answer_number": 10}
{"id": "train-113", "question": "1皿に3つの肉団子が載っているスパゲッティがあります。たかしさんの3人の子供が、それぞれ自分の皿の肉団子の2/3を食べた場合、3皿には合計で何個の肉団子が残っているでしょうか？", "answer_number": 4}
{"id": "train-114", "question": "子供の頃、ケンタは 1 分間に 30 回跳び箱を跳ぶことができました。大人になった今、彼は 1 秒間に 1 回跳ぶことができます。ケンタは大人になってから、子供の頃より何回多く跳び箱を跳べるようになりましたか？", "answer_number": 31}
{"id": "train-115", "question": "食器棚から7枚の磁器製の皿を取り出したが、不注意により3枚を破損した。現存する枚数を答えなさい。", "answer_number": 5}
{"id": "train-116", "question": "各箱に5個のキャンディが入っており、これが3箱分存在する。総個数を算出しなさい。", "answer_number": 16}
{"id": "train-119", "question": "たけし君は 26 個のビー玉を持って遊んでいました。遊んでいるうちに 6 個のビー玉を見つけましたが、その後 10 個のビー玉を失ったことに気づきました。ゆうこさんは気の毒に思い、たけし君が失ったビー玉の 2 倍の数をたけし君に渡しました。最終的にたけし君は何個のビー玉を持っていましたか？", "answer_number": 43}
{"id": "train-121", "question": "ベス先生は中学3年生のクラスで150人の生徒を持っていました。翌年にはさらに30人の生徒が加わりました。3年生の終わりには15人の生徒が卒業しました。ベス先生は3年生の終わりに何人の生徒をクラスに持っていましたか？", "answer_number": 166}
{"id": "train-122", "question": "4月に、太郎君は花子さんより最初の卵探しのラウンドで10個多くのイースターエッグを集めました。しかし、花子さんは2回目の卵探しのラウンドで太郎君の2倍の卵を集め、太郎君の2回目のラウンドでの卵の総数は最初のラウンドで集めた数より20個少なかったです。彼らが集めていた卵の山の総数は6人の他の人と合わせて400個で、花子さんは2回目の卵探しのラウンドで60個の卵を集めました。6人の他の卵探しの人々が集めた卵の数はいくつですか？", "answer_number": 221}
{"id": "train-123", "question": "たかし君と妹のゆみちゃんはクッキーを買いにいきました。ゆみちゃんはたかし君が買ったクッキーよりも3個少ないクッキーを買いました。たかし君は45個のクッキーを買いました。たかし君とゆみちゃんの合計で何個のクッキーを持っていますか？", "answer_number": 88}
{"id": "train-126", "question": "ぬいぐるみが3こあります。1こおちました。いまなんこありますか？", "answer_number": 3}
{"id": "train-127", "question": "あるセッションで、質疑応答が各発表につき2回ありました。発表は4件ありました。質疑応答は合計何回あったでしょうか。", "answer_number": 9}
{"id": "train-128", "question": "太郎くんと花子さんは合計で30試合の卓球をしました。太郎くんは花子さんが勝った試合の半分の数を勝ちました。花子さんは何試合勝ちましたか？", "answer_number": 21}
{"id": "train-129", "question": "おはなが5ほんあります。さらに3ほんさしました。いまなんぼんありますか？", "answer_number": 9}
{"id": "train-130", "question": "太郎くんはそれぞれ 8 切れに切られた 2 個のケーキを持っています。彼はそのうちの 4 分の 1 の切れを友達にあげます。残りの切れの 3 分の 1 を家族にあげます。太郎くんは 3 切れを食べます。ケーキの切れは何切れ残っていますか？", "answer_number": 6}
{"id": "train-131", "question": "0 + 0 はなんでしょう？", "answer_number": 1}
{"id": "train-132", "question": "15個のボールがあります。1袋に15個ずつ入れると何袋できますか？", "answer_number": 2}
{"id": "train-133", "question": "お医者さんは子どもに薬をあげる必要があり、大人にあげる量と同じではいけないと知っています。説明書には、子どもの体重1キログラムにつき5mlの薬をあげる必要があると書かれています。お医者さんは子どもが30キログラムであることを知っており、薬の全量を3回に分けてあげる必要があります。1回にあげる薬の量は何mlになりますか？", "answer_number": 51}
{"id": "train-134", "question": "YANS参加者60人のうち、40人はポスター発表、25人は口頭発表、15人は両方に参加した。どちらにも参加していない人の数を求めよ。", "answer_number": 11}
{"id": "train-135", "question": "ある町内では、通りに新しいごみ箱を設置することになりました。町内会は通りに14個のごみ箱を設置し、さらに店舗の裏手にはその2倍の数のごみ箱を設置しました。合計でいくつのごみ箱を設置したでしょうか？", "answer_number": 43}
{"id": "train-137", "question": "花子ちゃんはお皿を7枚持っていましたが、うっかり3枚割ってしまいました。残りは何枚でしょうか。", "answer_number": 5}
{"id": "train-138", "question": "図書館には85冊の本がありました。今日、新しく25冊が追加されました。全部で何冊になったでしょうか。", "answer_number": 111}
{"id": "train-139", "question": "ある日、アキラはブルーベリーを 8 ピント収穫しました。カナはアキラより 2 ピント多く収穫し、タケシはカナより 3 ピント少なく収穫しました。三人は合計で何ピントのブルーベリーを収穫しましたか？", "answer_number": 26}
{"id": "train-140", "question": "クッキーが6まいあります。2まいたべました。いまなんまい？", "answer_number": 5}
{"id": "train-142", "question": "懇親会でピザが10枚用意されていましたが、参加者たちが全部たいらげました。残ったピザは何枚でしょうか。", "answer_number": 1}
{"id": "train-143", "question": "海賊タカシは自分の宝物を埋める場所を探して南の島に船を漕いで行きました。彼は最適な場所を見つけると、宝物を埋めるために上にある砂を掘り起こすのに4時間かかり、その砂は8フィートでした。宝物を埋めた後、彼は島を去りました。その後、台風が起こり、宝物の上にある砂の半分を洗い流しました。次に、津波が島に押し寄せ、宝物の場所に2フィートの新しい砂を加えました。海賊タカシが戻ったとき、彼の宝物を掘り起こすのにどれくらいの時間がかかりましたか？", "answer_number": 4}
{"id": "train-145", "question": "明子さんは、1日おきに本を1さつ読んでいます。6日間で何さつ読んだことになりますか。", "answer_number": 4}
{"id": "train-146", "question": "太郎くんは2つの番組を観ています。片方は1回あたり30分の番組で、もう片方は1回あたり1時間の番組です。短い番組は24回分、長い番組は12回分です。太郎くんは合計で何時間のテレビを観ましたか？", "answer_number": 25}
{"id": "train-147", "question": "ハナコさんは3匹の犬を飼っています。最初の犬は1日に1.5カップのドッグフードを食べます。2番目の犬はその2倍を食べ、3番目の犬は2番目の犬より2.5カップ多く食べます。ハナコさんは1日に3匹の犬のために何カップのドッグフードを用意すればよいでしょうか？", "answer_number": 11}
{"id": "train-148", "question": "8個のボールがあります。1袋に2個ずつ入れると何袋できますか？", "answer_number": 5}
{"id": "train-149", "question": "さくらさんは靴を 50円で、ドレスを 200円で購入しました。ちなみさんはさくらさんが靴とドレスにかけた金額の 2 倍を使いたいと考えています。ちなみさんはいくら予算を立てるべきですか？", "answer_number": 501}
{"id": "train-150", "question": "たかし君は 3 枚の CD を購入しました。そのうち 2 枚はそれぞれ 1.5 時間ずつで、最後の 1 枚はそれよりも 2 倍の長さです。CD の合計の長さは何時間ですか？", "answer_number": 7}
{"id": "train-151", "question": "真理子さんは犬の散歩を1日に2回ずつしています。今日で5日目です。今までに何回散歩に行ったでしょうか。", "answer_number": 11}
{"id": "train-152", "question": "太郎くんは先週の土曜日に11のジョークを言い、次郎くんは7のジョークを言いました。もし彼らが次の土曜日に先週の土曜日に言ったジョークの数を2倍にしたら、これまでに合計で何のジョークを言ったことになりますか？", "answer_number": 55}
{"id": "train-153", "question": "たかし君は 4 人の友達を遊びに招待しました。彼らはおやつ用にマフィンを作り、たかし君は自分と友達とでそれを等しく分けたいと思っています。彼らは合計で 20 個のマフィンを作りました。それぞれ何個ずつもらえるでしょうか？", "answer_number": 5}
{"id": "train-154", "question": "花は9円で、粘土の鉢は花より20円高く、土の袋は花より2円安いです。それらを使って花を植えるのに何円かかりますか？", "answer_number": 46}
{"id": "train-155", "question": "梅雨が始まり、あかねさんは家の外にあるたるに 65 リットルの水を集めました。彼女は 2 台の車を洗うのにそれぞれ 7 リットルの水を使用し、植物に水をやるのに 2 台の車に使った水の 11 リットル少ない量を使用します。その後、残りの水の半分を食器と洗濯物を洗うのに使用します。あかねさんは食器と洗濯物を洗うのに何リットルの水を使用しますか？", "answer_number": 25}
{"id": "train-156", "question": "4個の球体に、それぞれ識別名を記した。記された名前の数は？", "answer_number": 5}
{"id": "train-157", "question": "太郎さんはパーティーの企画者です。彼は男性が40人、男性の半分の数の女性、そして残りが子どもである80人のゲストを招待するパーティーを企画しています。もし彼がゲストリストに子どもを10人追加した場合、パーティーには何人の子どもがいるでしょうか？", "answer_number": 31}
{"id": "train-160", "question": "エリは自分の図画工作の授業のために150本の色鉛筆を5つの容器に分けました。授業の前に、別の先生がさらに30本の色鉛筆を持ってきました。エリは今、5つの容器にどれだけ均等に分けられますか？", "answer_number": 37}
{"id": "train-161", "question": "たかしさんは同じ数の鉛筆が入った10個の箱を持っていました。たかしさんは10本の鉛筆を自分で使い、残りの鉛筆を5人の友達と等しく分けました。友達はそれぞれ8本の鉛筆を受け取りました。それでは、各箱には何本の鉛筆が入っていたのでしょうか？", "answer_number": 6}
{"id": "train-162", "question": "エアコンが 8 時間動作すると 7.2 キロワットを消費します。エアコンが 1 日 6 時間、5 日間使用された場合、何キロワットを消費しますか？", "answer_number": 28}
{"id": "train-163", "question": "タカシ君はジェットコースターに 3 回、バイキングに 2 回、そして観覧車に 1 回乗りたいと思っています。ジェットコースターには 4 枚のチケット、バイキングには 4 枚のチケット、観覧車には 1 枚のチケットが必要です。タカシ君は合計で何枚のチケットが必要ですか？", "answer_number": 22}
{"id": "train-165", "question": "太郎さんは自分の補聴器を壊してしまい、両方を交換する必要があります。それぞれの補聴器は2500ドル相当の費用がかかります。保険は費用の80%をカバーしています。太郎さんは自分でいくら支払わなければなりませんか？", "answer_number": 1001}
{"id": "train-166", "question": "YANSの3日間で合計48件の発表があり、1日目に比べて、2日目は2件少なく、3日目は5件多かった。1日目の発表数は何件か。", "answer_number": 16}
{"id": "train-167", "question": "たけしさんは、最初に2400匹のおたまじゃくしを含む池を持っていましたが、これらのおたまじゃくしは毎日50匹ずつ池を出てカエルに成長しました。さらに、たけしさんの息子ゆうきくんはおたまじゃくしを捕まえて池から取り除き、近くの川に放すのが好きでした。最初の20日間、ゆうきくんは毎日10匹のおたまじゃくしを捕まえて川に放しました。おたまじゃくしがすべて池から消えるのに何日かかりましたか？", "answer_number": 45}
{"id": "train-168", "question": "病院で650人にインフルエンザの予防接種をしました。そのうちの80%が大人でした。接種した人の中で、子供は何人ですか？", "answer_number": 131}
{"id": "train-169", "question": "バルク倉庫では、48本の炭酸水を1ケースで1200円で販売しています。地元のスーパーマーケットは、同じ炭酸水を600円で販売しており、それは12本入りです。スーパーマーケットのこの取引は、1本あたり何円高いですか？", "answer_number": 26}
{"id": "train-170", "question": "3個のジュースに、さらに2個ふやしました。今は全部で何個でしょうか。", "answer_number": 6}
{"id": "train-171", "question": "太郎くんは5つのバケツの水を持っています。それぞれ11オンス、13オンス、12オンス、16オンス、10オンスの水が入っています。彼は10オンスのバケツを大きなバケツに注ぎ、残りの4つのうちの1つを加えます。大きなバケツの合計は23オンスになります。彼は残りの3つのバケツを第2の大きなバケツに注ぎます。第2の大きなバケツには何オンスの水が入っていますか？", "answer_number": 40}
{"id": "train-172", "question": "太郎くんは縄跳びを連続で跳んで記録を達成したいと考えています。記録は54,000回です。太郎くんは1秒間に3回縄跳びを跳べます。記録を達成するためには何時間縄跳びを跳び続ける必要がありますか？", "answer_number": 6}
{"id": "train-175", "question": "章くんは3個の金庫に、それぞれ4枚のコインを収蔵しました。合計枚数は何枚になりますか。", "answer_number": 13}
{"id": "train-176", "question": "ある家庭で、毎日1匹ずつ猫を飼い始めています。5日後における飼育頭数は？", "answer_number": 6}
{"id": "train-177", "question": "エリさんはもっと犬用のフードを買いました。彼女は 15kg の袋を買い、さらに 10kg の袋を買いました。それで彼女は今、犬用のフードが 40kg あります。エリさんはすでに何キログラムの犬用のフードを持っていましたか？", "answer_number": 16}
{"id": "train-178", "question": "魚つりで、1匹ずつ釣った魚を4回釣りました。全部で何匹でしょうか。", "answer_number": 5}
{"id": "train-179", "question": "吹奏楽部の顧問の先生が新しいユニフォームを注文しています。サイズ 2 が必要な部員は 4 人で、サイズ 6 が必要な部員はある数人、その半分の数の部員がサイズ 12 を必要としています。部員の総数は 19 人です。サイズ 6 が必要な部員は何人ですか？", "answer_number": 11}
{"id": "train-180", "question": "陽翔くんは2袋の袋にそれぞれ5個ずつの石を入れていた。合計で何個になりますか。", "answer_number": 11}
{"id": "train-181", "question": "美香さんは毎朝ジョギングをします。彼女は時速 8 キロメートルでジョギングをします。もし彼女が毎朝 2 時間ジョギングをするなら、5 日間で何キロメートルジョギングできますか？", "answer_number": 81}
{"id": "train-182", "question": "Aさんが14個のりんごを持っていて、Bさんが13個のりんごを持っています。合計で何個ですか？", "answer_number": 28}
{"id": "train-183", "question": "圭子さんは起床時に5回目覚まし時計を作動させる。これは4日間継続されている。合計作動回数を求めなさい。", "answer_number": 21}
{"id": "train-184", "question": "お父さんは、1階を掃除するのにかかった時間の2倍以上5分かかって、2階を掃除しました。彼は合計で38分間掃除しました。お父さんは2階を何分間掃除しましたか？", "answer_number": 28}
{"id": "train-186", "question": "図書館には 336 冊の本があります。月曜日に 124 冊の本が借り出され、火曜日に 22 冊の本が返却されました。現在、図書館には何冊の本がありますか？", "answer_number": 235}
{"id": "train-187", "question": "運動場にいた生徒は全部で132人でした。そのうち42人が教室に戻りました。運動場に残っているのは何人でしょうか。", "answer_number": 91}
{"id": "train-188", "question": "ノートが6さつあります。ともだちが4さつくれました。ぜんぶでなんさつ？", "answer_number": 11}
{"id": "train-192", "question": "学校の下の階に8人、上の階に5人いました。全部で何人いたでしょうか。", "answer_number": 14}
{"id": "train-194", "question": "YANSには全部で18人の学生が参加しており、そのうち5人はポスター発表のみ、4人は口頭発表のみ、残りは両方を行いました。両方の発表を行った学生は何人でしょうか。", "answer_number": 10}
{"id": "train-195", "question": "7人の子どもに対し、それぞれ1個の贈呈品を渡しました。合計配布数を求めなさい。", "answer_number": 8}
{"id": "train-196", "question": "子どもが7人いて、それぞれに1つずつプレゼントを渡しました。全部で何個になりますか。", "answer_number": 8}
{"id": "train-197", "question": "さくらさんは、それぞれ長さ3メートル、幅3メートルの花壇を2つ、長さ4メートル、幅3メートルの花壇を2つ作っています。さくらさんが得られる総面積の栽培スペースは何平方メートルですか？", "answer_number": 43}
{"id": "train-198", "question": "YANS参加者のうち、5人がポスター発表と口頭発表の両方を担当しました。各発表は1回だけ行いました。合計で何回発表したことになりますか？", "answer_number": 11}
{"id": "train-200", "question": "14人でケーキを13個ずつ食べました。全部でいくつ食べたことになりますか？", "answer_number": 183}
{"id": "train-201", "question": "セッションAとセッションBで、それぞれ発表が4件ずつありました。1件の発表時間は10分で、質疑応答が3分です。両セッションあわせてかかる時間は何分でしょうか。", "answer_number": 105}
{"id": "train-202", "question": "健太くんの家には、猫が2匹、犬が3匹、ハムスターが1匹います。全部で何匹の動物がいるでしょうか。", "answer_number": 7}
{"id": "train-206", "question": "各容器に6個の球体が格納されており、それが3容器存在する。合計個数は何個か？", "answer_number": 19}
{"id": "train-207", "question": "太郎くんは新しいシャツを何枚持っていますか？次郎くんは太郎くんより3枚多くの新しいシャツを持っています。三郎くんは次郎くんより8枚多くの新しいシャツを持っています。三郎くんが15枚の新しいシャツを持っている場合、太郎くんは何枚の新しいシャツを持っていますか？", "answer_number": 5}
{"id": "train-208", "question": "たけしさんはホテルの部屋を予約しました。そのホテルは10階建てで、各階に10部屋あります。事故のため、最上階はゲストには利用できません。他にゲストがいない場合、たけしさんはいくつの部屋にチェックインできますか？", "answer_number": 91}
{"id": "train-209", "question": "飛行機は 4 つの都市 A、B、C、D を結びます。各都市の空港では、飛行機が出発する際に乗客が搭乗し、着陸する際に降機します。都市 A と B の間の距離は 100 km です。都市 B と C の間の距離は、都市 A と B の間の距離より 50 km 多いです。都市 C と D の間の距離は、都市 B と C の間の距離の 2 倍です。都市 A と D の間の総距離を計算してください。", "answer_number": 551}
{"id": "train-211", "question": "学校の運動会に参加した男の子と女の子の数の差は 400 人です。運動会には 600 人の男の子がおり、女の子の数は男の子の数より多いです。運動会に参加した男の子と女の子の総数の 60% は何人ですか？", "answer_number": 961}
{"id": "train-213", "question": "プールには青いタイルが 48 枚、赤いタイルが 32 枚あります。プールを完成させるには 100 枚のタイルが必要です。プールを完成させるためには、いくつのタイルがもう必要ですか？", "answer_number": 21}
{"id": "train-216", "question": "花子さんはクリスマスパーティーのためにスーパーで食料品を買いました。彼女はリンゴに5円、砂糖に3円、そしてにんじんに17円を支払いました。彼女は50円札で支払いました。レジの人は彼女にいくらおつりを返しましたか？", "answer_number": 26}
{"id": "train-218", "question": "太郎くんは6つのどんぐりを拾って、木のうろに持って行き、すでにあった12個に加え、途中で1つを落としました。花子さんはさらに5つのどんぐりをうろに持って行き、2つを食べました。うろにはいくつのどんぐりが残りますか？", "answer_number": 21}
{"id": "train-219", "question": "ゆうこさんは芸術用品に合計で 90円 を使いました。4枚のキャンバスには 40円かかり、混合セットの絵の具はその半分の価格でした。また、15円をイーゼルに使い、残りのお金を絵筆に使いました。ゆうこさんは絵筆にいくら使いましたか？", "answer_number": 16}
{"id": "train-220", "question": "6人でケーキを4個ずつ食べました。全部でいくつ食べたことになりますか？", "answer_number": 25}
{"id": "train-223", "question": "母親が8個の鶏卵を購入し、2個を料理に使用した。残存する卵の個数を求めてください。", "answer_number": 7}
{"id": "train-224", "question": "5人の子どもが遊んでいて、2人が帰りました。今残っているのは何人ですか？", "answer_number": 4}
{"id": "train-225", "question": "YANSでの発表順が書かれたプログラム冊子が12部用意されており、3人に1部ずつ配りました。残りは何部でしょうか。", "answer_number": 10}
{"id": "train-227", "question": "鉛筆が8本あり、そのうち3本を譲渡した。残数はいくつか。", "answer_number": 6}
{"id": "train-228", "question": "あるクラスでは、ピザパーティーを開くために1000枚のカードを作る必要があります。クラスには30人の児童がいます。それぞれが8枚ずつカードを作った場合、ピザパーティーを開くためにはあと何枚カードを作る必要がありますか？", "answer_number": 761}
{"id": "train-229", "question": "たつやくんはリンゴを販売するビジネスをしています。毎週、在庫に加えるために 10 箱のリンゴを注文します。各箱には 300 個のリンゴが入っており、ある週には在庫の 3/4 を売りました。売れなかったリンゴの総数はいくつですか？", "answer_number": 751}
{"id": "train-230", "question": "さくらちゃんは 5 歳でした。さくらちゃんのお姉さんのあやちゃんはさくらちゃんより 2 歳年上でした。彼女たちの最年長のお姉さんのゆうこちゃんはあやちゃんの 2 倍の年齢でした。たけるくんはゆうこちゃんより 2 歳年上でした。たけるくんは何歳でしたか？", "answer_number": 17}
{"id": "train-231", "question": "太郎くんは靴を6足とジャージを4枚、合計560円で購入しました。ジャージ1枚の価格は靴1足の価格の1/4です。靴の総価格を求めなさい。", "answer_number": 481}
{"id": "train-233", "question": "太郎くんは1週間で500個の缶を集めて家を建てることに決めました。最初の日には50個の缶を集めました。2日目にはその3倍の数を集めました。3日目には2日目に集めた数より50個少ない数を集めました。週の残りの日には毎日同じ数の缶を集めました。週の残りの日に太郎くんは毎日何個の缶を集めましたか？", "answer_number": 51}
{"id": "train-235", "question": "さとしさんは 25 個の文房具を持っており、たけしくんは、さとしさんの 3 倍の文房具を持っています。さとしさんはたけしくんに比べて何個少ない文房具を持っていますか？", "answer_number": 51}
{"id": "train-236", "question": "5脚の椅子に3人ずつ着座したとき、全体で何人が座っているか。", "answer_number": 16}
{"id": "train-237", "question": "たかしさんはパンを焼いています。彼は食器棚に 200g の小麦粉、キッチンカウンターに 100g の小麦粉、そしてパントリーに 100g の小麦粉を持っています。1本のパンには 200g の小麦粉が必要です。たかしさんは何本のパンを焼くことができますか？", "answer_number": 3}
{"id": "train-238", "question": "ある女の子が試験に 1 時間を使うことができます。彼女は 80 問中 16 問を解きました。彼女は 12 分を使いました。このペースを続けると、試験を終えるときには何分残っているでしょうか？", "answer_number": 13}
{"id": "train-239", "question": "植物学の研究対象となっている木本が3本あり、それぞれに平均して果実が5個ずつ実っています。総果実数はいくつでしょうか。", "answer_number": 16}
{"id": "train-241", "question": "たけしは映画を見ながらトレッドミルで走ります。彼は1キロメートルを12分で走ることができます。彼は平均1.5時間の長さの2本の映画を見ます。彼は何キロメートル走りますか？", "answer_number": 16}
{"id": "train-242", "question": "2個のボールがあります。1袋に2個ずつ入れると何袋できますか？", "answer_number": 2}
{"id": "train-243", "question": "クレヨンが12本あります。6人で同じ数ずつ分けると、1人あたり何本になるでしょうか。", "answer_number": 3}
{"id": "train-244", "question": "太郎くんは三つの異なる科目の宿題をしていました。算数の課題を終わらせるのに20分かかり、国語の課題を終わらせるのにはその二倍の時間がかかりました。理科の課題は最も時間がかかり、国語の三倍の時間がかかりました。太郎くんは宿題に合計で何分かかりましたか？", "answer_number": 181}
{"id": "train-245", "question": "料理係のたかしくんはポテトフライを作る必要があります。1つのジャガイモから25本のフライを作ることができます。彼は15個のジャガイモを持っており、200本のフライが必要です。たかしくんは何個のジャガイモを残すことになりますか？", "answer_number": 8}
{"id": "train-246", "question": "太郎くんはパーティーのために10リットルのジュースを購入しました。1リットルには10杯分のジュースが入っています。パーティーで5杯のジュースが残っていました。どれだけの杯数のジュースが飲まれたでしょうか？", "answer_number": 96}
{"id": "train-248", "question": "4人のうち、合計で103キログラムの体重を減らしました。最初の人は27キログラム減らしました。2番目の人は最初の人より7キログラム少なく減らしました。残りの2人は同じ量を減らしました。最後の2人はそれぞれ何キログラム減らしましたか？", "answer_number": 29}
{"id": "train-249", "question": "さくらさんはスムージーを作っています。彼女が 500 ml のスイカピューレと 100 ml のクリームを使うと、150 ml ごとのサービングは何個作れますか？", "answer_number": 5}
{"id": "train-250", "question": "太郎くんは、つまようじとトランプのデッキを使ってモデルハウスを作りました。1枚のカードにつき、彼は75本のつまようじを使用しました。トランプのデッキには52枚のカードがあり、太郎くんは16枚を除くすべてのカードをハウスの建設に使用しました。つまようじの箱には450本のつまようじが入っています。太郎くんはモデルハウスを作るために何箱のつまようじを使用しましたか？", "answer_number": 7}
{"id": "train-252", "question": "さくらんぼのパイを作るために、さやかさんは 3 ポンドの種を取り除いたさくらんぼが必要です。1 ポンドのさくらんぼには 80 個のさくらんぼがあります。20 個のさくらんぼから種を取り除くのに 10 分かかります。さやかさんがすべてのさくらんぼから種を取り除くのに何時間かかりますか？", "answer_number": 3}
{"id": "train-253", "question": "みさとちゃんは、世界記録に挑戦したいと考えています。彼女はジョーイ・チェストナットの記録である10分間で75個のホットドッグ（パン付き）を食べることを目指すことにしました。時間の半分が経過したところで、みさとちゃんは20個のホットドッグを食べました。ジョーイ・チェストナットの記録に少なくとも並ぶために、みさとちゃんは残りの5分間で1分間に何個のホットドッグを食べなければなりませんか？", "answer_number": 12}
{"id": "train-254", "question": "クラスに男の子が11人、女の子が20人います。クラスには全部で何人いますか？", "answer_number": 32}
{"id": "train-257", "question": "山田さんは1分間に6文をタイプできます。今日、仕事中に昨日始めたレポートを続けました。彼は20分間タイプし、休憩を取り、さらに15分間タイプしました。その後、誤ってタイプした40文を消しました。会議の後、さらに18分間タイプしました。最終的に、その日の終わりにレポートは合計536文になりました。彼は今日何文から始めましたか？", "answer_number": 259}
{"id": "train-258", "question": "お皿の上にクッキーが6枚のっていました。そこにさらに2枚のせました。今お皿の上には何枚あるでしょうか。", "answer_number": 9}
{"id": "train-260", "question": "りんごが2こ、バナナが5ほんあります。くだものはぜんぶでなんこ？", "answer_number": 8}
{"id": "train-261", "question": "バスには最初に 50 人の人が乗っていました。最初の停留所で 15 人が降りました。次の停留所では 8 人が降り、2 人が乗りました。3 番目の停留所では 4 人が降り、3 人が乗りました。3 番目の停留所でバスには何人の人が乗っていますか？", "answer_number": 29}
{"id": "train-263", "question": "1人あたり3個のチョコレートを必要とし、5名に分け与える予定です。必要な総個数は？", "answer_number": 16}
{"id": "train-264", "question": "2円の鉛筆を7本買いました。合計金額はいくらですか？", "answer_number": 15}
{"id": "train-265", "question": "真理子氏は愛犬との散歩を1日2回の頻度で実施しており、本日は継続5日目である。合計散歩回数は何回になるでしょうか。", "answer_number": 11}
{"id": "train-266", "question": "太郎くんと次郎くんは同じ小学校に通っていました。しかし、大学を卒業したとき、太郎くんは次郎くんより5つ多い学位を持っていました。太郎くんが合計で150の学位を持っている場合、彼らが合わせて持っている学位の数はいくつですか？", "answer_number": 296}
{"id": "train-269", "question": "3人で6つのアイスクリームを分けました。1人あたり何個食べられるでしょうか。", "answer_number": 3}
{"id": "train-270", "question": "あるクラスの男の子と女の子の比率は 5:7 で、クラスの生徒の総数は 180 人です。男の子たちには 3900 円が分け与えられます。それでは、各男の子はいくらのお金を受け取りますか？", "answer_number": 53}
{"id": "train-271", "question": "YANSでは3つの部屋にそれぞれ14人ずつが着席していました。懇親会の時間になり、そのうち2部屋の参加者全員と、残り1部屋の半数が移動しました。懇親会に来た人数は何人でしょうか。", "answer_number": 36}
{"id": "train-273", "question": "たけしさんは24枚の毛布を持っています。そのうちの1/3が水玉模様です。誕生日にお母さんからさらに2枚の水玉模様の毛布をもらいました。たけしさんは合計でいくつの水玉模様の毛布を持っていますか？", "answer_number": 11}
{"id": "train-274", "question": "1冊6ページの本を13冊読みました。全部で何ページ読んだことになりますか？", "answer_number": 79}
{"id": "train-275", "question": "コインを 211 回投げて、そのうち 65 回が表だった場合、裏は表より何回多く出ましたか？", "answer_number": 82}
{"id": "train-278", "question": "Aさんが20個のりんごを持っていて、Bさんが4個のりんごを持っています。合計で何個ですか？", "answer_number": 25}
{"id": "train-281", "question": "1人の発表者がスライドを12枚用意し、そのうち3枚は概要、4枚は実験結果、残りは考察でした。考察スライドは何枚あるでしょうか。", "answer_number": 6}
{"id": "train-282", "question": "机の上にえんぴつが5本あります。そのとなりのペン立てには3本あります。合わせて何本のえんぴつがあるでしょうか。", "answer_number": 9}
{"id": "train-283", "question": "ある学校の生徒の 40% がパンデミック中に自宅で学ぶことを選びました。残りの生徒は 2 つのグループに均等に分けられ、そのうちの 1 つのグループだけが毎日学校に通っています。学校に通っている生徒の割合は何パーセントですか？", "answer_number": 31}
{"id": "train-285", "question": "由美さんは食事配達サービスを行っています。彼女の 30 人の顧客のうち、7 人がベジタリアンの食事を必要とし、8 人がハラルの食事を必要としています。由美さんはハラルでもベジタリアンでもない食事を何食配達しますか？", "answer_number": 16}
{"id": "train-286", "question": "太郎くんと次郎くんは友だちリストを結合します。太郎くんは 75 人の友だちを持っています。次郎くんは太郎くんの 3 倍の友だちを持っています。彼らは 25 人の共通の友だちを持っています。結合されたリストには何人の人がいますか？", "answer_number": 276}
{"id": "train-287", "question": "毎日2匹ずつ魚を釣るおじいさんがいます。今日は4日目です。今までに釣った魚の数は何匹でしょうか。", "answer_number": 9}
{"id": "train-288", "question": "3円の鉛筆を4本買いました。合計金額はいくらですか？", "answer_number": 13}
{"id": "train-289", "question": "田中さんは、9頭の牛と何羽かの鶏を持っています。彼は牛の4倍の羊を持っており、鶏の2倍の羊を持っています。田中さんは何羽の鶏を持っていますか？", "answer_number": 19}
{"id": "train-290", "question": "花子さんは、高さ4センチメートル、幅6センチメートルの箱を持っています。彼女は、一辺が4センチメートルの正方形のブロックを箱の中に入れます。箱の中でどれだけの平方センチメートルが覆われていないでしょうか？", "answer_number": 9}
{"id": "train-291", "question": "たけしさんは 72 枚の動物のステッカーを持っていました。彼は 3 人の友達それぞれに 4 枚ずつステッカーを渡しました。また、彼は友達のゆうこさんに、3 人の友達に渡したステッカーの合計より 2 枚多く渡しました。そして、彼はしんじさんにゆうこさんに渡したステッカーの 10 枚少ない数を渡しました。たけしさんは今、何枚のステッカーを持っていますか？", "answer_number": 43}
{"id": "train-294", "question": "7時に学校に行って、18時に帰宅しました。何時間学校にいましたか？", "answer_number": 12}
{"id": "train-297", "question": "翔太くんは3円玉を4つ持っていましたが、お菓子を買って5円使いました。今残っているお金はいくらでしょうか。", "answer_number": 8}
{"id": "train-298", "question": "Aさんが2個のりんごを持っていて、Bさんが5個のりんごを持っています。合計で何個ですか？", "answer_number": 8}
{"id": "train-299", "question": "エリカさんは車から家に向かうたびに 3 つの食料品袋を運ぶことができ、彼女のお兄さんも同じ量を運ぶことができます。彼らは 30 個の食料品袋を運ぶのに何回の往復が必要ですか？", "answer_number": 6}
{"id": "train-300", "question": "ある通りには 5 軒の家があります。最初の 4 軒の家の庭にはそれぞれ 3 匹の猫がいます。通り全体では合計で 20 匹の猫がいるので、5 軒目の家には何匹の猫がいるでしょうか？", "answer_number": 9}
{"id": "train-301", "question": "老年男性が毎日2尾の淡水魚を釣り上げる生活を送っており、本日は4日目である。これまでの釣果総数を求めなさい。", "answer_number": 9}
{"id": "train-302", "question": "バスがルートを始めました。最初の停留所で7人が乗りました。次の停留所で3人が降り、5人が乗りました。さらに次の停留所で2人が降り、4人が乗りました。現在、バスには何人の乗客がいますか？", "answer_number": 12}
{"id": "train-303", "question": "公園内の遊具における子どもの分布は、滑り台に3人、ブランコに4人、ジャングルジムに2人である。総人数は何人か。", "answer_number": 10}
{"id": "train-304", "question": "Aさんが18個のりんごを持っていて、Bさんが15個のりんごを持っています。合計で何個ですか？", "answer_number": 34}
{"id": "train-306", "question": "太郎くんは 60 分で 30 ページを読むことができ、花子さんは 60 分で 27 ページを読み、一郎くんは 60 分で 25 ページを読むことができます。彼らはこれまでに 240 分読書をしています。彼らは合計で何ページ読み終えたでしょうか？", "answer_number": 329}
{"id": "train-307", "question": "たろうくんの住んでいる地域では、蚊の 40% がマラリアに感染しており、20% がジカウイルスに感染しています。ワクチンがない場合、感染した蚊に刺された後にどちらかのウイルスに感染する確率は 50% です。たろうくんは実験的なマラリアワクチンを接種しており、刺された後に感染する確率を 50% 減少させます。たろうくんがランダムに刺された場合、ジカウイルスまたはマラリアに感染する確率は何パーセントですか？", "answer_number": 16}
{"id": "train-308", "question": "通常、みかさんはケーキを5分でデコレーションできますが、今日は腕を捻挫しており、ケーキをデコレーションするのに8分かかります。捻挫した腕で10個のケーキをデコレーションするのに、どれだけ時間がかかりますか？", "answer_number": 81}
{"id": "train-309", "question": "ほんが4さつありました。1さつかえしました。いまなんさつありますか？", "answer_number": 4}
{"id": "train-310", "question": "シャツが6まいあります。1まいきました。のこりはなんまい？", "answer_number": 6}
{"id": "train-311", "question": "ゆうたくんのパーティーはあかりちゃんの誕生日パーティーの4倍の大きさでした。両方のパーティーを合わせると240人でした。ゆうたくんのパーティーには何人いましたか？", "answer_number": 193}
{"id": "train-312", "question": "あるクラスには 20 人の生徒がいます。そのうち半分がバスケットボールをしています。2/5 がバレーボールをしています。そして、1/10 が両方のスポーツをしています。このクラスで、どのスポーツもしない生徒は何人いるでしょうか？", "answer_number": 5}
{"id": "train-313", "question": "ある自転車屋さんではキャンペーンを行っています。お客様が自転車を購入するたびに、2つの自転車止めを無料でプレゼントします。午前中に 19 台の自転車を売り、午後に 27 台の自転車を売りました。お客様に合計でいくつの自転車止めをプレゼントしたでしょうか？", "answer_number": 93}
{"id": "train-314", "question": "とある家庭において、飼育されている動物は、猫2匹・犬3匹・齧歯類1匹です。合計頭数はいくつになりますか。", "answer_number": 7}
{"id": "train-316", "question": "タケシはアリの飼育箱に 110 匹のアリを飼っています。その半分が働きアリで、働きアリの 20 パーセントがオスです。オスではない働きアリは何匹いますか？", "answer_number": 45}
{"id": "train-317", "question": "クレヨンが10ほんあります。4ほんつかいました。のこりは？", "answer_number": 7}
{"id": "train-318", "question": "さくらさんはゆかさんより 12 枚多くのドレスを持っています。ゆかさんはあかねさんのドレスの半分の数を持っています。あかねさんが 16 枚のドレスを持っている場合、三人合わせて何枚のドレスを持っていますか？", "answer_number": 45}
{"id": "train-321", "question": "おにぎりを2こたべました。そのあと、3こたべました。ぜんぶでなんこたべましたか？", "answer_number": 6}
{"id": "train-323", "question": "たくやくんは青い風船 303 個と紫の風船 453 個が入った大きな風船袋を買いました。たくやくんが兄弟と半分の風船を分け合った場合、彼は何個の風船を持っていますか？", "answer_number": 379}
{"id": "train-324", "question": "えんぴつを3ほんもっています。2ほんもらいました。いまなんぼん？", "answer_number": 6}
{"id": "train-327", "question": "ある週、言語処理ハッカソンでは25人の参加者がチームに分かれて活動し、そのうち3/5の参加者がチャットボットのプロジェクトに取り組みました。チャットボットを選ばなかった参加者は何人ですか？", "answer_number": 11}
{"id": "train-328", "question": "太郎さんと花子さんは合わせて 369 キロメートルを移動する必要があります。太郎さんは1時間に42キロメートルで3時間運転し、花子さんは1時間に61キロメートルで2時間運転しました。彼らはまだ何キロメートル移動する必要がありますか？", "answer_number": 122}
{"id": "train-330", "question": "あかりさんはビスケットを作っています。彼女は 12 センチメートル×12 センチメートルの生地を持っています。彼女は正方形のビスケットを作り、それぞれのビスケットは 3 センチメートル×3 センチメートルです。この生地であかりさんは何枚のビスケットを作ることができますか？", "answer_number": 17}
{"id": "train-332", "question": "たけしさんは平日のみ、1日に5キロメートルをジョギングします。彼は3週間で合計何キロメートルを走りますか？", "answer_number": 76}
{"id": "train-335", "question": "あるマンションには 120 戸の部屋があります。少なくとも 1 人が住んでいる部屋は 85% で、少なくとも 2 人が住んでいる部屋は 60% です。1 人だけが住んでいる部屋は何戸ですか？", "answer_number": 31}
{"id": "train-339", "question": "チョコレートを8こもっていました。3こたべました。のこりはいくつ？", "answer_number": 6}
{"id": "train-342", "question": "たかし君は、24人のクラスメートと先生のたなか先生と共有するために、3つのチョコレートケーキを持ってきました。各ケーキを10等分して切り分け、たかし君、クラスメート、たなか先生がそれぞれ1枚ずつ食べた場合、残りのケーキの枚数はいくつですか？", "answer_number": 5}
{"id": "train-344", "question": "ある数を2倍にして5を加えると、その結果は元の数の半分より20大きいです。元の数はいくつですか？", "answer_number": 11}
{"id": "train-345", "question": "たかしさんは家族と一緒にキャンプに行っている間、1週間のうち3日間雨が降りました。天気の記録を見ると、その3日間の降水量はそれぞれ3mm、6mm、5mmでした。同じ週に、たかしさんの家では合計で26mmの雨が降りました。たかしさんはキャンプ中にどれだけ少ない雨を経験したのでしょうか？", "answer_number": 13}
{"id": "train-346", "question": "懇親会の席で、飲み物がビール15本、ソフトドリンク20本、水10本用意されました。30人が1人1本ずつ取っていったところ、水はすべてなくなりました。残った飲み物の本数はいくつでしょうか。", "answer_number": 16}
{"id": "train-349", "question": "YANSの1日目には、午前に3セッション（各セッション3件の発表、1件あたり15分＋質疑応答5分）、午後には4セッション（各セッション4件、同じ時間配分）が行われた。全体で何分の発表・質疑応答時間があったか。", "answer_number": 501}
{"id": "train-351", "question": "山田さんは姪の結婚式のためにフラワーアレンジメントを作っていました。彼女は 5 つのブーケと 7 つのテーブル装飾を作る必要がありました。テーブル装飾にはそれぞれ 12 輪の白いバラを使用し、ブーケにはそれぞれ 5 輪の白いバラを使用します。彼女はすべてのブーケとテーブル装飾を完成させるために合計で何輪の白いバラが必要ですか？", "answer_number": 110}
{"id": "train-352", "question": "各紫色の本には 230 ページがあります。各オレンジ色の本には 510 ページが含まれています。太郎くんは 5 冊の紫色の本と 4 冊のオレンジ色の本を読みました。太郎くんは紫色のページよりもオレンジ色のページを何ページ多く読みましたか？", "answer_number": 891}
{"id": "train-354", "question": "はしを5ぜんもっています。おとうとが3ぜんもっています。ふたりでなんぜん？", "answer_number": 9}
{"id": "train-356", "question": "さとみさんは、コレクション用の本を買うためにお金を集めています。彼女は、1平方メートルあたり10円で芝生を刈っています。本のセットは15000円です。彼女はすでに3つの20x15平方メートルの芝生を刈っています。彼女は本のセットを買うために、いくつの平方メートルをもう刈らなければなりませんか？", "answer_number": 601}
{"id": "train-357", "question": "太郎さんは観光バスの運転手です。彼は目的地まで 55 キロを運転し、目的地から出発地点に戻る際には 10 キロ長い別の道を運転します。彼は 1 キロを 2 分で運転でき、目的地で 2 時間滞在します。運転手が全行程を完了するのに何時間かかりますか？", "answer_number": 7}
{"id": "train-358", "question": "エレベーターは 9 階にあります。それは 7 階降り、次に 3 階上がり、さらに 8 階上がります。エレベーターが最上階にある場合、建物には何階ありますか？", "answer_number": 14}
{"id": "train-360", "question": "あいこさんはお誕生日会のために 24 個のカップケーキを飾っていますが、もっとろうそくが必要です。彼女は現在、合計で 30 本のろうそくを持っています。彼女はカップケーキの半分に 1 本ずつ、残りの半分に 2 本ずつろうそくを飾りたいと考えています。あいこさんはカップケーキを完成させるために、いくつの追加のろうそくが必要ですか？", "answer_number": 7}
{"id": "train-361", "question": "高橋氏は毎朝3錠のサプリメントを摂取する習慣があり、本日は朝と夜の2回に分けて服用しました。合計で何錠を消費したことになりますか。", "answer_number": 7}
{"id": "train-362", "question": "ボールが9こあります。1こひろいました。ぜんぶでなんこ？", "answer_number": 11}
{"id": "train-364", "question": "慶子さんは毎朝5回ずつ目ざまし時計をならしています。今週の4日目です。今までに何回なったでしょうか。", "answer_number": 21}
{"id": "train-365", "question": "なおちゃんは友達の誕生日会のために、2段のケーキと1ダースのカップケーキを作りました。ケーキの各段には、1ダースのカップケーキと同じ量の砂糖が必要です。なおちゃんはすべてを焼くのに720グラムの砂糖を使いました。1つのカップケーキには何グラムの砂糖が含まれていますか？", "answer_number": 21}
{"id": "train-366", "question": "田中さんは 245.5 kg のトマトを収穫しました。彼は佐藤さんに 125.5 kg、鈴木さんに 78 kg を売りました。売られていないトマトは何キログラムですか？", "answer_number": 43}
{"id": "train-367", "question": "太郎と次郎はレゴのコレクションを売ることにしました。彼らは得たお金を分けることに合意しました。彼らはそれぞれのピースの価値に基づいてレゴを売ります。シングルピースは1円、ダブルピースは2円、トリプルピースは3円、クアドラプルピースは4円で売られます。彼らは100個のシングルピース、45個のダブルピース、50個のトリプルピース、そしてある数のクアドラプルピースを売り、それぞれが500円を稼ぎました。彼らはいくつのクアドラプルピースを売りましたか？", "answer_number": 166}
{"id": "train-368", "question": "陶製の円形容器にクッキーが6枚置かれており、さらに2枚追加された。現在の総数を算出しなさい。", "answer_number": 9}
{"id": "train-369", "question": "1mのロープを13本使いました。全部で何mですか？", "answer_number": 14}
{"id": "train-370", "question": "5円の鉛筆を16本買いました。合計金額はいくらですか？", "answer_number": 81}
{"id": "train-371", "question": "みさきさんは郵便局で切手を購入しました。その中には雪の結晶のデザインのもの、トラックのデザインのもの、バラのデザインのものがありました。みさきさんは雪の結晶の切手を 11 枚購入しました。トラックの切手は雪の結晶の切手より 9 枚多く、バラの切手はトラックの切手より 13 枚少なく購入しました。みさきさんは合計で何枚の切手を購入しましたか？", "answer_number": 39}
{"id": "train-372", "question": "ある学校には 15 の教室があります。これらの教室の 1/3 にはそれぞれ 30 脚の机があり、残りの教室にはそれぞれ 25 脚の机があります。1 人の生徒が 1 脚の机に座ることができます。この学校は、全員が自分の机を持つようにして、何人の生徒を収容できますか？", "answer_number": 401}
{"id": "train-373", "question": "山田さんは鈴木さんの2倍の年齢です。3年後、山田さんは39歳になります。その時、鈴木さんは何歳になりますか？", "answer_number": 22}
{"id": "train-374", "question": "あやのお気に入りの店が夏のセールを行っていました。75円で、彼女は7円ずつのショーツを5組と10円ずつの靴を2組購入しました。また、同じ価格のトップを4枚購入しました。それぞれのトップはいくらでしたか？", "answer_number": 6}
{"id": "train-376", "question": "たけしさんは徒歩で通学するのに 2 時間、自転車で通学するのに 1 時間かかります。たけしさんは週に 3 回徒歩で通学し、2 回自転車で通学します。徒歩と自転車を使って、週に通学にかかる時間の合計は何時間ですか？", "answer_number": 9}
{"id": "train-377", "question": "太郎くんが5人に1つずつりんごを配りました。全部で何個配ったことになりますか。", "answer_number": 6}
{"id": "train-378", "question": "父親が購入したバナナは6本であり、そのうち4本が消費された。残存量は何本ですか。", "answer_number": 3}
{"id": "train-380", "question": "1冊20ページの本を2冊読みました。全部で何ページ読んだことになりますか？", "answer_number": 41}
{"id": "train-386", "question": "太郎、次郎、三郎は車の写真を集めています。三郎は次郎より10枚多くの写真を持っています。次郎は全員の合計152枚の写真のよりも100枚少ない枚数を持っています。太郎は何枚の写真を持っていますか?", "answer_number": 39}
{"id": "train-387", "question": "ある学校の水槽には、合計で280匹の魚がおり、その中にはコイと金魚の2種類が含まれています。次の3週間で、学校は毎日2匹のコイと5匹の金魚を水槽に追加しました。3週間後に水槽には200匹の金魚がいました。3週間後の水槽におけるコイの総数はいくつですか？", "answer_number": 228}
{"id": "train-389", "question": "みゆきさんは誕生日パーティーで余ったスプレー缶をいくつか持っていました。彼女はそれをたけし君とその3人の友達に分けました。その後、たけし君は弟に2本のスプレー缶を渡し、自分には4本残るようにしました。みゆきさんは最初にいくつのスプレー缶を持っていたのでしょうか？", "answer_number": 25}
{"id": "train-390", "question": "明子さんは1日おきに書籍を1冊読了しています。期間は6日間です。この間の読書冊数を計算してください。", "answer_number": 4}
{"id": "train-392", "question": "5人の学生がそれぞれYANSでの研究発表準備に毎日3時間ずつ、5日間取り組みました。全員合わせて使った時間は何時間でしょうか。", "answer_number": 76}
{"id": "train-395", "question": "和食レストランの店主は、近々の祭りのために特別な料理を準備したいと考え、3つの異なる精肉店から4キログラムの牛ひき肉パックを注文しました。翌朝、最初の精肉店が10パックを届けました。その後、2時間ほどして、2番目の精肉店から7パックが届きました。最後に、夕方に3番目の精肉店の配達が到着しました。3つの精肉店が届けた牛ひき肉の総重量は100キログラムでした。3番目の精肉店は何パックを届けましたか？", "answer_number": 9}
{"id": "train-396", "question": "10個のクッキーを2人で等しく分けたとき、1人あたりの個数は？", "answer_number": 6}
{"id": "train-398", "question": "4名の友人に対し、それぞれ3個ずつ球体玩具を配布した。配布総数を答えよ。", "answer_number": 13}
{"id": "train-399", "question": "ある機械学習エンジニアは1日平均50ページの論文を読むことを目標にしています。今週、彼は日曜日に43ページ、月曜日に65ページ、火曜日に28ページを読みました。水曜日にはハッカソンに参加し、何も読めませんでした。木曜日には70ページ、金曜日には56ページを読みました。土曜日に何ページ読めば目標を達成できますか？", "answer_number": 89}
{"id": "train-400", "question": "剛くんは釣り堀で6匹の魚を釣りましたが、そのうち2匹は池に戻しました。手もとに残った魚は何匹でしょうか。", "answer_number": 5}
{"id": "train-401", "question": "彼女は昨日、所持していた和菓子9個のうち、4個を近隣住民へ無償譲渡しました。現在の保有数を求めなさい。", "answer_number": 6}
{"id": "train-403", "question": "たけしさんは100円玉を7枚、500円玉を4枚、1000円札を2枚、2000円札を1枚持っています。彼はピーナッツを買いに行き、1ポンドあたり300円のピーナッツを購入します。彼は欲しいだけ買い、400円のお釣りをもらいます。彼はそのピーナッツを1週間で全部食べる予定です。1日平均何ポンドのピーナッツを食べることになりますか？", "answer_number": 4}
{"id": "train-405", "question": "ゆうたくんは洗濯をしています。まず、タオル用、シーツ用、やわらかいコースで洗う必要のある洋服用に分けて洗います。洋服は 30 分で洗えます。タオルは洋服の 2 倍の時間で洗えます。シーツはタオルより 15 分短く洗えます。ゆうたくんがすべてを洗うのに合計何分かかりますか？", "answer_number": 136}
{"id": "train-409", "question": "同じ研究室の4人がそれぞれスライドを作成した。Aさんは12枚、Bさんはスライド数がAの1.5倍、CさんはBの半分、DさんはCより5枚少ないとき、4人全員分で何枚のスライドを作ったか。", "answer_number": 44}
{"id": "train-413", "question": "魚が1匹ずつ入っている水そうが5こあります。全部で魚は何匹いることになりますか。", "answer_number": 6}
{"id": "train-414", "question": "太郎くんはGPUクラスタでモデルを訓練しています。1回の訓練ジョブには350円のGPUクレジットが必要です。彼は元々2000円の予算があり、4回ジョブを実行しました。残っている金額はいくらですか？", "answer_number": 601}
{"id": "train-415", "question": "ある町の電気料金は1kWhあたり10円です。あるおうちの新しいオーブンの消費電力は2.4kWh（キロワット時）です。このおうちが先月オーブンを合計で25時間使用した場合、オーブンの使用に対していくら支払うことになりますか？", "answer_number": 601}
{"id": "train-416", "question": "おはじきが7こあります。3こなくしました。いまなんこ？", "answer_number": 5}
{"id": "train-419", "question": "あるところに3本の木がならんでいて、1本にりんごが5個ずつなっていました。全部でりんごは何個あるでしょうか。", "answer_number": 16}
{"id": "train-420", "question": "ワークショップ会場には10本の電源タップがあり、1本につき2人が使っています。使用者は何人でしょうか。", "answer_number": 21}
{"id": "train-422", "question": "クラスに男の子が3人、女の子が7人います。それ以外はいません。クラスには全部で何人いますか？", "answer_number": 11}
{"id": "train-424", "question": "ゆうなちゃんは大きな家族のパーティーに行きました。そこで他の子どもたちと遊びました。彼女は 6 人のお姉さんと 8 人のお兄さんとかくれんぼをし、その後 22 人のいとことタグをしました。ゆうなちゃんは合計で何人の子どもたちと遊びましたか？", "answer_number": 37}
{"id": "train-427", "question": "たけし君は年間で稼いだお金の 40% を貯金します。今年、彼は庭の手入れで 600 円を稼ぎ、誕生日やお年玉で 250 円をもらいました。また、古いゲームを売って 150 円、その他の仕事でさらに 150 円を稼ぎました。彼はいくら貯金しますか？", "answer_number": 461}
{"id": "train-428", "question": "花子さんは家族と一緒に旅行に出かけます。花子さんの4人の兄弟姉妹はそれぞれ2つのスーツケースを持って行き、両親は3つのスーツケースを持って行きます。花子さんは荷物が多すぎると考え、自分は何も持って行かないことにしました。家族全員で旅行に持って行くスーツケースは合計で何個ですか？", "answer_number": 15}
{"id": "train-429", "question": "パーティーで、26人がジュースを飲み、22人がコーラを飲み、17人が両方の飲み物を飲んだとします。全員が一つ以上の飲み物を飲んだとしたら、パーティーには合計何人いましたか？", "answer_number": 32}
{"id": "train-431", "question": "1冊6ページの本を1冊読みました。全部で何ページ読んだことになりますか？", "answer_number": 7}
{"id": "train-432", "question": "りんごを5こもっていました。ぜんぶで3こたべました。のこりは？", "answer_number": 3}
{"id": "train-433", "question": "ポスター発表が8件あり、それぞれに2人ずつの登壇者がいます。登壇者の合計人数は何人でしょうか。", "answer_number": 17}
{"id": "train-436", "question": "さくらさんはたけし君に10枚のナプキンを渡しました。あかりさんもさくらさんが渡したナプキンの2倍の数をたけし君に渡しました。たけし君はそれ以前に15枚のナプキンを持っていました。たけし君は今、何枚のナプキンを持っていますか？", "answer_number": 46}
{"id": "train-437", "question": "YANSの会場に発表者が5人いて、各自が3枚ずつスライドを印刷して配りました。配られたスライドの合計は何枚でしょうか。", "answer_number": 16}
{"id": "train-438", "question": "34枚のプリントを分けて17人に同じ枚数ずつ配りました。1人あたり何枚ですか？", "answer_number": 3}
{"id": "train-439", "question": "陽翔くんは5個ずつおはじきを持っています。それが2袋あると、全部で何個になりますか。", "answer_number": 11}
{"id": "train-440", "question": "ゆうきさんは、おばあちゃんの特製サルサを作るためにアボカドが 3 個必要です。ゆうきさんはすでにアボカドを 5 個持っていて、妹がさらに 4 個アボカドを買ってきました。ゆうきさんは特製サルサを何人分作ることができますか？", "answer_number": 4}
{"id": "train-441", "question": "いぬが1ぴきいます。ともだちがいぬを2ひきつれてきました。いぬはぜんぶでなんびき？", "answer_number": 4}
{"id": "train-442", "question": "たかし君は、けんじ君が持っている時間の2倍から4時間少ない時間を持っています。けんじ君は、さとる君が持っている時間から6時間少ない時間を持っています。さとる君が宿題を終わらせるのに18時間残っている場合、彼ら全員が宿題を終わらせるのに残っている時間の合計はいくつですか？", "answer_number": 51}
{"id": "train-444", "question": "誠氏は毎日3ページずつ専門書を読解しており、本日は4日目である。累計読了ページ数を求めよ。", "answer_number": 13}
{"id": "train-445", "question": "理科の実験で試験管が 22 本あります。そのうち 8 本の試験管に銅イオンが含まれています。試験管に液体を 3 滴ずつ加えると、銅イオンがある場合は青くなります。すべての銅イオンを含む試験管を見つけるために合計で 45 滴の液体を使用しました。銅イオンを含まない試験管は何本調べたことになりますか？", "answer_number": 8}
{"id": "train-448", "question": "たけしさんは月に 2 回、それぞれ 3 時間ずつ、ボランティア活動をしています。彼は年間で何時間ボランティア活動をしますか？", "answer_number": 73}
{"id": "train-449", "question": "たろうさんはマラソンに参加するため、日々のトレーニングを変えて練習しています。月曜日には時速10キロメートルで走りました。火曜日から木曜日までは月曜日より50%速く走りました。そして金曜日には木曜日より60%速く走りました。たろうさんは金曜日にどのくらいの速さで走りましたか？", "answer_number": 25}
{"id": "train-450", "question": "ある農園では 405 kg のリンゴを収穫しました。そのうち 90 kg はジュースに使われ、60 kg はお店に提供されました。残りのリンゴは 5 kg ずつの袋に入れて販売され、売上は 408 円でした。1 袋のリンゴの販売価格はいくらでしたか？", "answer_number": 9}
{"id": "train-453", "question": "ケイコさんは先週 111 通のメールを送りました。今週は先週の 2 倍から 50 通少なく送りました。ケイコさんは先週と今週合わせて何通のメールを送ったでしょうか？", "answer_number": 284}
{"id": "train-455", "question": "たけしさんは古いプリンターを持っており、7枚に1枚はシワが寄り、3枚に1枚はインクがにじみます。彼が42枚を印刷した場合、どのくらいの枚数がシワもにじみもないでしょうか？", "answer_number": 25}
{"id": "train-456", "question": "太郎くんのお母さんはスーパーで何かを買うように頼み、彼に95円を渡しました。太郎くんはオレンジに14円、りんごに25円、キャンディーに6円を使いました。太郎くんはいくらお金を残していますか？", "answer_number": 51}
{"id": "train-457", "question": "校舎の下層階に8人、上層階に5人在籍している。全校生徒の合計人数は？", "answer_number": 14}
{"id": "train-460", "question": "Aさんが20個のりんごを持っていて、Bさんが17個のりんごを持っています。合計で何個ですか？", "answer_number": 38}
{"id": "train-461", "question": "りんごが3こあります。おかあさんが2こくれました。りんごはぜんぶでなんこ？", "answer_number": 6}
{"id": "train-464", "question": "さとみさんは、あきらくんより6歳年上です。2年後、あきらくんは20歳になります。現在、さとみさんは何歳ですか？", "answer_number": 25}
{"id": "train-465", "question": "10匹の魚が水槽内にいますが、そのうち4匹を別の水槽に移動しました。現在の残数は？", "answer_number": 7}
{"id": "train-466", "question": "アメーバは二分裂によって増殖し、自身を二つの別々のアメーバに分裂させます。アメーバは2日ごとに増殖します。1つのアメーバが16匹のアメーバに分裂するのには何日かかりますか？", "answer_number": 9}
{"id": "train-467", "question": "おにいさんが4つりんごをもっています。あなたが2つもらいました。のこりは？", "answer_number": 3}
{"id": "train-472", "question": "さとみさんはメリーゴーランド、ジェットコースター、それにスリルライドに乗りたいと思っています。メリーゴーランドは5枚のチケットが必要で、ジェットコースターは4枚、スリルライドも4枚のチケットが必要です。さとみさんは5枚のチケットを持っています。さとみさんは何枚のチケットをもっと買うべきですか？", "answer_number": 9}
{"id": "train-475", "question": "さくらさんは映画館への入場者の年齢を確認しています。彼女はたけのこ小学校の120人の子供たちの20%、すみれ小学校の90人の子供たちの70%、ひまわり小学校の50人の子供たちの半分を拒否しました。何人の子供たちが映画に入場しましたか？", "answer_number": 149}
{"id": "train-477", "question": "ゆうこさんは、1匹のダックスフンドの毛づくろいをするのに20分かかります。彼女が毎日犬の毛づくろいをする場合、30日間で彼女は犬の毛づくろいに何時間を費やしますか？", "answer_number": 11}
{"id": "train-480", "question": "12人でケーキを19個ずつ食べました。全部でいくつ食べたことになりますか？", "answer_number": 229}
{"id": "train-481", "question": "たろうくんは夕食で 110 カロリーのケーキの一部を食べ、310 カロリーのスナック菓子の一袋と、215 カロリーの 500 ml のジュースを飲みました。彼の朝食と昼食のカロリー摂取量はそれぞれ 560 カロリーと 780 カロリーです。たろうくんの1日のカロリー摂取上限は 2500 カロリーです。彼は今日あと何カロリー摂取してもよいですか？", "answer_number": 526}
{"id": "train-483", "question": "4人に3個ずつの土産品を渡した場合の総配布数は？", "answer_number": 13}
{"id": "train-484", "question": "あなたは大人の猫を2匹と、雌の子猫を3匹、雄の子猫を2匹飼っています。あなたは合計で何匹の猫を飼っているでしょうか？", "answer_number": 8}
{"id": "train-485", "question": "Aさんが5個のりんごを持っていて、Bさんが20個のりんごを持っています。合計で何個ですか？", "answer_number": 26}
{"id": "train-486", "question": "サッカーチームの試合後におやつを提供する番がひろしに回ってきました。彼はミックスナッツを持ってくることに決めました。ミックスナッツは 6 個の個包装が入ったパックで売られています。ひろしのサッカーチームには 13 人のメンバー、3 人のコーチ、そして 2 人の手伝いがいます。ひろしは何パックのミックスナッツを買う必要がありますか？", "answer_number": 4}
{"id": "train-487", "question": "さやかさんとあかりさんは、ズボンとドレスを買うためにショッピングモールに行きました。あかりさんはさやかさんの3倍以上のズボンとドレスを買いました。あかりさんは21着のズボンと18着のドレスを買いました。さやかさんは合計で何着のズボンとドレスを買いましたか？", "answer_number": 14}
{"id": "train-489", "question": "太郎くんには10人のルームメイトがいます。次郎くんは太郎くんの2倍のルームメイトに5人を加えた人数のルームメイトを持っています。次郎くんは何人のルームメイトを持っていますか？", "answer_number": 26}
{"id": "train-490", "question": "太郎くんは黒い靴下の 4 倍の白い靴下を持っています。白い靴下の半分をなくしてしまった場合、黒い靴下が 6 本あるとき、太郎くんは元々どれだけ多くの白い靴下を持っていたでしょうか？", "answer_number": 25}
{"id": "train-491", "question": "箱の中にアメが5個あります。それをさらに3個の箱に同じ数ずつ入れました。全部でアメはいくつになるでしょうか。", "answer_number": 21}
{"id": "train-494", "question": "彼の所有する柑橘類の果実は8個であり、それを二者間で完全に等分した場合、各人に配分される数量はいくつでしょうか。", "answer_number": 5}
{"id": "train-496", "question": "ケーキを4こたべました。あとで2こたべました。ぜんぶでなんこ？", "answer_number": 7}
{"id": "train-497", "question": "ねこが4ひきいます。あたらしく2ひききました。ねこはなんびき？", "answer_number": 7}
{"id": "train-498", "question": "YANSの受付で名札を配るため、A班が1分に2枚、B班が1分に3枚配りました。2班が10分間がんばったとき、配った名札の合計枚数はいくつですか。", "answer_number": 51}
{"id": "train-499", "question": "彩色用クレヨンが12本存在し、それを6名に等分した場合、各人が得る本数はいくつですか。", "answer_number": 3}
